s = """
	Автор закончил текст словами: «По мнению родителей, мы с бабушкой поступали 
неразумно и были неправильными людьми, и это нас объединяло».
Я понимаю эту фразу так. Между бабушкой и рассказчиком было полное взаимпонимание,
но семья не могла их понять.

	Например, в предложении 15 мы читаем, что рассказчик и его бабушка не хотели рано вставать,
чтобы зниматься спортом, тогда как мама и папа считли, что надо укреплять иммунитет.
Родители обвиняют героев за то, что они, по их мнению, не действуют согласно плану (предложение 15).

	Таким образом, бабушку и рассказчика объединяли их общие взгляды на жизнь.
А родители считали их неразумными и неправильными людьми.
"""
print(len(s.split(' ')))